FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_I2C.c
/*-------------------------------------------------------------------------*
 * File:  RX62N_I2C.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the Renesas RX62N I2C Interface using RIIC.
 * Implementation:
 *      A single I2C0 is created, but the code can be easily changed for
 *      other processors to use multiple I2C busses.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://goo.gl/UDtTCR for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <uEZ.h>
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <HAL/Interrupt.h>
#include "RX62N_UtilityFuncs.h"
#include "RX62N_I2C.h"

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef volatile struct st_riic __evenaccess T_RX62N_i2cRegs;

typedef enum {
    I2C_STATE_IDLE,
    I2C_STATE_START,
    I2C_STATE_ADDR,
    I2C_STATE_DATA,
    I2C_STATE_END,
    I2C_STATE_STOP,
} T_i2cState;

typedef enum {
    I2C_INTERRUPT_ICEEI,
    I2C_INTERRUPT_ICRXI,
    I2C_INTERRUPT_ICTXI,
    I2C_INTERRUPT_ICTEI,
} T_i2cInterrupt;

typedef struct {
    const HAL_I2CBus *iHAL;
    T_RX62N_i2cRegs *iRegs;
    I2C_Request *iRequest;
    TUInt8 iAddress;
    TUInt8 *iData;
    TUInt8 iDataLen;
    TUInt8 iIndex;
    I2CRequestCompleteCallback iCompleteFunc;
    void *iCompleteWorkspace;
    TUInt8 iMSTPBBit;
    TBool iFirstInit;
    T_i2cState iState;
    T_uezGPIOPortPin iSDAPin;
    T_uezGPIOPortPin iSCLPin;
    volatile TBool iDoneFlag;
} T_RX62N_I2C_Workspace;

typedef TUInt8 T_RX62N_i2cMode;
#define I2C_MODE_READ           1
#define I2C_MODE_WRITE          0

/*-------------------------------------------------------------------------*
 * Macros:
 *-------------------------------------------------------------------------*/
#define BIT_TDRE    (1<<7)
#define BIT_TEND    (1<<6)
#define BIT_RDRF    (1<<5)
#define BIT_NACKF   (1<<4)
#define BIT_STOP    (1<<3)
#define BIT_START   (1<<2)
#define BIT_AL      (1<<1)
#define BIT_TMOF    (1<<0)

/*-------------------------------------------------------------------------*
 * Globals:
 *-------------------------------------------------------------------------*/
static T_RX62N_I2C_Workspace *G_RX62N_i2c0Workspace;
static T_RX62N_I2C_Workspace *G_RX62N_i2c1Workspace;

/*-------------------------------------------------------------------------*
 * Function Prototypes:
 *-------------------------------------------------------------------------*/
IRQ_ROUTINE( IRX62N_I2C0InterruptHandler_ICEEI);
IRQ_ROUTINE( IRX62N_I2C0InterruptHandler_ICTXI);
IRQ_ROUTINE( IRX62N_I2C0InterruptHandler_ICRXI);
IRQ_ROUTINE( IRX62N_I2C0InterruptHandler_ICTEI);
IRQ_ROUTINE( IRX62N_I2C1InterruptHandler_ICEEI);
IRQ_ROUTINE( IRX62N_I2C1InterruptHandler_ICTXI);
IRQ_ROUTINE( IRX62N_I2C1InterruptHandler_ICRXI);
IRQ_ROUTINE( IRX62N_I2C1InterruptHandler_ICTEI);

static void IRX62N_ProcessState(
        T_RX62N_I2C_Workspace *p,
        T_i2cInterrupt aInterrupt);
static void IRX62N_ProcessStateWrite(
        T_RX62N_I2C_Workspace *p,
        T_i2cInterrupt aInterrupt);

#if 0 // #if DEBUG_I2C_TRACK_INTERRUPTS
#define TRACK_SIZE 200
char G_track[TRACK_SIZE];
static int32_t track_num = 0;
static void track_start(void)
{
    int32_t i;
    for (i=0; i<TRACK_SIZE; i++)
    G_track[i] = 0;
    track_num = 0;
}
static void track(char c)
{
    if (track_num < TRACK_SIZE)
    G_track[track_num++] = c;
}
static void track_hex(TUInt8 aHex)
{
    static const TUInt8 hex[] = "0123456789ABCDEF";
    if (track_num < TRACK_SIZE)
    G_track[track_num++] = hex[aHex>>4];
    if (track_num < TRACK_SIZE)
    G_track[track_num++] = hex[aHex&0x0F];
}
#else
#define track_start()       ((void)0)
#define track(c)            ((void)0)
#define track_hex(hex)      ((void)0)
#endif

/*-------------------------------------------------------------------------*/
void IRX62N_I2CSetSpeed(T_RX62N_i2cRegs *aRegs, TUInt16 aSpeed)
{
    T_RX62N_i2cRegs *p_regs = aRegs;
    TUInt32 clocks;
    TUInt8 n;

    clocks = (PCLK_FREQUENCY / 1000) / aSpeed;
    n = 0;
    while (clocks >= 32) {
        n++;
        clocks /= 2;
    }

    // TBD: The following assumes perfect rise and fall times on the
    //      low and high parts of the I2C timing.  If this is not the case,
    //      the resulting speed will be somewhat slower.
    // 7 works
    p_regs->ICMR1.BIT.CKS = 3; //n;
    p_regs->ICBRL.BIT.BRL = 25; //(clocks>>1)-1;
    p_regs->ICBRH.BIT.BRH = 25; // (clocks>>1)-1;
}

void IRX62N_I2CInit(T_RX62N_I2C_Workspace *p)
{
    T_RX62N_i2cRegs *p_regs = p->iRegs;
    TUInt32 delay;

    if (!p->iFirstInit) {
        // Turn on the I2C peripheral (by changing MSTPCRB bit to zero)
        SYSTEM.MSTPCRB.LONG &= ~(1 << p->iMSTPBBit);

        // Disable the RIIC
        p_regs->ICCR1.BIT.ICE = 0;

        // Do an internal reset
        p_regs->ICCR1.BIT.IICRST = 1;
        // Wait for reset
        for (delay = 0; delay < 1000000; delay++) {
        }
        // Cancel reset
        p_regs->ICCR1.BIT.IICRST = 0;

        // Disable slave addr (we are master mode)
        p_regs->ICSER.BIT.SAR0E = 0;

        // Configure the speed
        IRX62N_I2CSetSpeed(p->iRegs, p->iRequest->iSpeed);

