FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_I2C.c
        // Done, now send a stop bit (for one more interrupt)
        p_regs->ICSR2.BIT.STOP = 0;
        p_regs->ICCR2.BIT.SP = 1;
        // Clear the receive register
        dummy = p_regs->ICDRR;
        p->iState = I2C_STATE_STOP;
        //doEnd = ETrue;
    }
    if (doEnd) {
        track('!');
        // Wait for stop bit to en quickly
        //        while (!p_regs->ICSR2.BIT.STOP)
        //            {}
        // Done, Clear NACK and STOP flags
        p_regs->ICSR2.BIT.NACKF = 0;
        p_regs->ICSR2.BIT.STOP = 0;

        // We are now done, call the callback routine to report
        // completion.  The callback knows this is inside an ISR
        p->iState = I2C_STATE_IDLE;
        p->iDoneFlag = ETrue;
        p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);

        // Stop receiving all interrupts
        p_regs->ICIER.BYTE = 0x00;
    }
}

T_uezError IRX62N_I2C_IsHung(void *aWorkspace, TBool *aBool)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_RX62N_I2C_Workspace *p = (T_RX62N_I2C_Workspace *)aWorkspace;
    TBool sda, scl;

    sda = UEZGPIORead(p->iSDAPin);
    scl = UEZGPIORead(p->iSCLPin);

    *aBool = (!scl || !sda) ? ETrue : EFalse;

    return error;
}

T_uezError IRX62N_I2C_ResetBus(void *aWorkspace)
{
    T_uezError error = UEZ_ERROR_NONE;
    //T_RX62N_I2C_Workspace *p = (T_RX62N_I2C_Workspace *)aWorkspace;
    //TODO: implement reset functionality.

    return error;
}

static void IRX62N_ProcessState(
        T_RX62N_I2C_Workspace *p,
        T_i2cInterrupt aInterrupt)
{
    if (p->iAddress & 1)
        IRX62N_ProcessStateRead(p, aInterrupt);
    else
        IRX62N_ProcessStateWrite(p, aInterrupt);
}

IRQ_ROUTINE(IRX62N_I2C0InterruptHandler_ICEEI)
{
    IRQ_START();
    IRX62N_ProcessState(G_RX62N_i2c0Workspace, I2C_INTERRUPT_ICEEI);
    IRQ_END();
}
IRQ_ROUTINE(IRX62N_I2C0InterruptHandler_ICRXI)
{
    IRQ_START();
    IRX62N_ProcessState(G_RX62N_i2c0Workspace, I2C_INTERRUPT_ICRXI);
    IRQ_END();
}
IRQ_ROUTINE(IRX62N_I2C0InterruptHandler_ICTXI)
{
    IRQ_START();
    IRX62N_ProcessState(G_RX62N_i2c0Workspace, I2C_INTERRUPT_ICTXI);
    IRQ_END();
}
IRQ_ROUTINE(IRX62N_I2C0InterruptHandler_ICTEI)
{
    IRQ_START();
    IRX62N_ProcessState(G_RX62N_i2c0Workspace, I2C_INTERRUPT_ICTEI);
    IRQ_END();
}

IRQ_ROUTINE(IRX62N_I2C1InterruptHandler_ICEEI)
{
    IRQ_START();
    IRX62N_ProcessState(G_RX62N_i2c1Workspace, I2C_INTERRUPT_ICEEI);
    IRQ_END();
}
IRQ_ROUTINE(IRX62N_I2C1InterruptHandler_ICRXI)
{
    IRQ_START();
    IRX62N_ProcessState(G_RX62N_i2c1Workspace, I2C_INTERRUPT_ICRXI);
    IRQ_END();
}
IRQ_ROUTINE(IRX62N_I2C1InterruptHandler_ICTXI)
{
    IRQ_START();
    IRX62N_ProcessState(G_RX62N_i2c1Workspace, I2C_INTERRUPT_ICTXI);
    IRQ_END();
}
IRQ_ROUTINE(IRX62N_I2C1InterruptHandler_ICTEI)
{
    IRQ_START();
    IRX62N_ProcessState(G_RX62N_i2c1Workspace, I2C_INTERRUPT_ICTEI);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_I2C0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N I2C Bus0 workspace.
 * Inputs:
 *      void *aW                    -- Particular I2C workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_I2C0_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_I2C_Workspace *p = (T_RX62N_I2C_Workspace *)aWorkspace;

    p->iRegs = (T_RX62N_i2cRegs *)&RIIC0;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    p->iMSTPBBit = 21;
    p->iFirstInit = EFalse;
    PORT1.ICR.BIT.B2 = 1;
    PORT1.ICR.BIT.B3 = 1;
    p->iState = I2C_STATE_IDLE;

    G_RX62N_i2c0Workspace = p;

    // Setup interrupt vectors
    InterruptRegister(VECT_RIIC0_ICEEI0, IRX62N_I2C0InterruptHandler_ICEEI,
            INTERRUPT_PRIORITY_LOW, "I2C0:ICEEI");
    InterruptEnable(VECT_RIIC0_ICEEI0);

    InterruptRegister(VECT_RIIC0_ICRXI0, IRX62N_I2C0InterruptHandler_ICRXI,
            INTERRUPT_PRIORITY_LOW, "I2C0:ICRXI");
    InterruptEnable(VECT_RIIC0_ICRXI0);

    InterruptRegister(VECT_RIIC0_ICTXI0, IRX62N_I2C0InterruptHandler_ICTXI,
            INTERRUPT_PRIORITY_LOW, "I2C0:ICTXI");
    InterruptEnable(VECT_RIIC0_ICTXI0);

    InterruptRegister(VECT_RIIC0_ICTEI0, IRX62N_I2C0InterruptHandler_ICTEI,
            INTERRUPT_PRIORITY_LOW, "I2C0:ICTEI");
    InterruptEnable(VECT_RIIC0_ICTEI0);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_I2C1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX62N I2C Bus1 workspace.
 * Inputs:
 *      void *aW                    -- Particular I2C workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_I2C1_InitializeWorkspace(void *aWorkspace)
{
    T_RX62N_I2C_Workspace *p = (T_RX62N_I2C_Workspace *)aWorkspace;

    p->iRegs = (T_RX62N_i2cRegs *)&RIIC1;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    p->iMSTPBBit = 20;
    p->iFirstInit = EFalse;
    PORT2.ICR.BIT.B2 = 1;
    PORT2.ICR.BIT.B1 = 1;

    p->iState = I2C_STATE_IDLE;

    G_RX62N_i2c1Workspace = p;

    // Setup interrupt vectors
    InterruptRegister(VECT_RIIC1_ICEEI1, IRX62N_I2C1InterruptHandler_ICEEI,
            INTERRUPT_PRIORITY_NORMAL, "I2C1:ICEEI");
    InterruptEnable(VECT_RIIC1_ICEEI1);

    InterruptRegister(VECT_RIIC1_ICRXI1, IRX62N_I2C1InterruptHandler_ICRXI,
            INTERRUPT_PRIORITY_NORMAL, "I2C1:ICRXI");
    InterruptEnable(VECT_RIIC1_ICRXI1);

    InterruptRegister(VECT_RIIC1_ICTXI1, IRX62N_I2C1InterruptHandler_ICTXI,
            INTERRUPT_PRIORITY_NORMAL, "I2C1:ICTXI");
    InterruptEnable(VECT_RIIC1_ICTXI1);

    InterruptRegister(VECT_RIIC1_ICTEI1, IRX62N_I2C1InterruptHandler_ICTEI,
            INTERRUPT_PRIORITY_NORMAL, "I2C1:ICTEI");
    InterruptEnable(VECT_RIIC1_ICTEI1);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * HAL Interface tables:
 *---------------------------------------------------------------------------*/
const HAL_I2CBus I2C_RX62N_RIIC0_Interface = {
        "RX62N:I2C0",
        0x0100,
        RX62N_I2C0_InitializeWorkspace,
        sizeof(T_RX62N_I2C_Workspace),

        IRX62N_I2C_StartReadInterrupts,
        IRX62N_I2C_StartWriteInterrupts,
        0,0,0,
        IRX62N_I2C_IsHung, IRX62N_I2C_ResetBus};

const HAL_I2CBus I2C_RX62N_RIIC1_Interface = {
        "RX62N:I2C1",
        0x0100,
        RX62N_I2C1_InitializeWorkspace,
        sizeof(T_RX62N_I2C_Workspace),

        IRX62N_I2C_StartReadInterrupts,
        IRX62N_I2C_StartWriteInterrupts,
        0,0,0,
        IRX62N_I2C_IsHung, IRX62N_I2C_ResetBus
        };
		
void RX62N_RIIC0_Require(void)
{
	T_RX62N_I2C_Workspace *p;
	static const T_uezGPIOPortPin pins[] = {
           	GPIO_P12,  	// SCL0
			GPIO_P13,	// SDA0
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("RIIC0", (T_halInterface *)&I2C_RX62N_RIIC0_Interface, 0, (T_halWorkspace **)&p);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));

    p->iSCLPin = GPIO_P12;
    p->iSDAPin = GPIO_P13;
}

void RX62N_RIIC1_Require(void)
{
	T_RX62N_I2C_Workspace *p;
	static const T_uezGPIOPortPin pins[] = {
           	GPIO_P21,  	// SCL1
			GPIO_P20,	// SDA1
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("RIIC1", (T_halInterface *)&I2C_RX62N_RIIC1_Interface, 0, (T_halWorkspace **)&p);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));

    p->iSCLPin = GPIO_P21;
    p->iSDAPin = GPIO_P20;
}

/*-------------------------------------------------------------------------*
 * End of File:  RX62N_I2C.c
 *-------------------------------------------------------------------------*/
